lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf3000/fsl_pf3000.c
        /* Process LDO X, including LDO1, LDO3, LDO4. */
        case kPF3000_ModuleLdo1:
        case kPF3000_ModuleLdo3:
        case kPF3000_ModuleLdo4:
            for (index = PF3000_LDOX_SET_POINT_MAX_NUM; index > 0U; index--)
            {
                if ((PF3000_LDOX_OUTPUT_LIMIT_LOW_DVS + (PF3000_LDOX_OUTPUT_STEP_DVS * index)) <= voltage)
                {
                    break;
                }
            }
            break;

        /* Process LDO Y, including LDO2. */
        case kPF3000_ModuleLdo2:
            for (index = PF3000_LDOY_SET_POINT_MAX_NUM; index > 0U; index--)
            {
                if ((PF3000_LDOY_OUTPUT_LIMIT_LOW_DVS + (PF3000_LDOY_OUTPUT_STEP_DVS * index)) <= voltage)
                {
                    break;
                }
            }
            break;

        /* Process Vcc_sd. */
        case kPF3000_ModuleVcc_sd:
            /* VSD_VSEL= 0. */
            if (handle->vccsdVsel == 0U)
            {
                for (index = PF3000_VCC_SD_SET_POINT_MAX_NUM; index > 0U; index--)
                {
                    if ((PF3000_VCC_SD_OUTPUT_LIMIT_LOW_DVS + (PF3000_VCC_SD_OUTPUT_STEP_DVS * index)) <= voltage)
                    {
                        break;
                    }
                }
            }
            /* VSD_VSEL= 1. */
            else
            {
                if (1850000U <= voltage)
                {
                    index = 0x3U;
                }
                else
                {
                    index = 0x0U;
                }
            }
            break;

        /* Process Vcc_sd. */
        case kPF3000_ModuleV33:
            for (index = PF3000_V33_SET_POINT_MAX_NUM; index > 0U; index--)
            {
                if ((PF3000_V33_OUTPUT_LIMIT_LOW_DVS + (PF3000_V33_OUTPUT_STEP_DVS * index)) <= voltage)
                {
                    break;
                }
            }
            break;

        default:
            index = 0U;
            break;
    }

    /* Assin index to  regulatorSetPoint*/
    regulatorSetPoint = index;

    return regulatorSetPoint;
}

static uint32_t PF3000_GetRegulatorOutputVolt(pf3000_handle_t *handle, pf3000_module_t module, uint8_t voltRegContent)
{
    uint32_t voltage = 0U;

    assert(handle);
    assert((kPF3000_ModuleSwitch1A == module) || (kPF3000_ModuleSwitch1B == module) ||
           (kPF3000_ModuleSwitch2 == module) || (kPF3000_ModuleSwitch3 == module) ||
           (kPF3000_ModuleSwitchBoost == module) || (kPF3000_ModuleLdo1 == module) || (kPF3000_ModuleLdo2 == module) ||
           (kPF3000_ModuleLdo3 == module) || (kPF3000_ModuleLdo4 == module) || (kPF3000_ModuleVcc_sd == module) ||
           (kPF3000_ModuleV33 == module) || (kPF3000_ModuleVsnvs == module));

    switch (module)
    {
        /* Process Switch 1A. */
        case kPF3000_ModuleSwitch1A:
        /* Process Switch 1B. */
        case kPF3000_ModuleSwitch1B:
            if ((handle->switch1Mode == kPF3000_SW1SinglePhase) ||
                ((handle->switch1Mode == kPF3000_SW1IndependentMode) && (module == kPF3000_ModuleSwitch1A)))
            {
                if (voltRegContent <= (PF3000_SW1A_SET_POINT_MAX_NUM - 2))
                {
                    voltage = PF3000_SW1A_OUTPUT_LIMIT_LOW_DVS + PF3000_SW1A_OUTPUT_STEP_DVS * voltRegContent;
                }
                else if (voltRegContent == (PF3000_SW1A_SET_POINT_MAX_NUM - 1))
                {
                    voltage = 1800000U;
                }
                else if (voltRegContent == (PF3000_SW1A_SET_POINT_MAX_NUM))
                {
                    voltage = 3300000U;
                }
                else
                {
                    ;
                }
            }
            else if ((handle->switch1Mode == kPF3000_SW1IndependentMode) && (module == kPF3000_ModuleSwitch1B))
            {
                voltage = PF3000_SW1B_OUTPUT_LIMIT_LOW_DVS + PF3000_SW1B_OUTPUT_STEP_DVS * voltRegContent;
            }
            else
            {
                ;
            }
            break;

        /* Process Switch 2. */
        case kPF3000_ModuleSwitch2:
            /* OTP_SW2_HI= 0, SW2 is in low output voltage range */
            if (handle->switch2Range == kPF3000_SW2LowVoltRange)
            {
                voltage = PF3000_SW3_OUTPUT_LIMIT_LOW_DVS + PF3000_SW3_OUTPUT_STEP_DVS * voltRegContent;
            }
            /* OTP_SW2_HI= 1, SW2 is in high output voltage range */
            else
            {
                switch (voltRegContent)
                {
                    case 0x0U:
                        voltage = 2500000U;
                        break;
                    case 0x1U:
                        voltage = 2800000U;
                        break;
                    case 0x2U:
                        voltage = 2850000U;
                        break;
                    case 0x3U:
                        voltage = 3000000U;
                        break;
                    case 0x4U:
                        voltage = 3100000U;
                        break;
                    case 0x5U:
                        voltage = 3150000U;
                        break;
                    case 0x6U:
                        voltage = 3200000U;
                        break;
                    case 0x7U:
                        voltage = 3300000U;
                        break;
                    default:
                        voltage = 0U;
                        break;
                }
            }
            break;

        /* Process Switch 3. */
        case kPF3000_ModuleSwitch3:
            voltage = PF3000_SW3_OUTPUT_LIMIT_LOW_DVS + PF3000_SW3_OUTPUT_STEP_DVS * voltRegContent;
            break;

        /* Process Switch Boost. */
        case kPF3000_ModuleSwitchBoost:
            voltage = PF3000_SW_BST_OUTPUT_LIMIT_LOW_DVS + PF3000_SW_BST_OUTPUT_STEP_DVS * voltRegContent;
            break;

