lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/pf3000/fsl_pf3000.c
    switch (module)
    {
        /* Process SW1A, SW1B. */
        case kPF3000_ModuleSwitch1A:
        case kPF3000_ModuleSwitch1B:
            regulatorVoltRegAddr = switchVoltRegTab[module][status];
            regulatorVoltRegMask = PF3000_SW1X_VOLT_CTRL_MASK;
            break;

        /* Process SW2. */
        case kPF3000_ModuleSwitch2:
            regulatorVoltRegAddr = switchVoltRegTab[module][status];
            regulatorVoltRegMask = PF3000_SW2_VOLT_CTRL_MASK;
            break;

        /* Process SW3. */
        case kPF3000_ModuleSwitch3:
            regulatorVoltRegAddr = switchVoltRegTab[module][status];
            regulatorVoltRegMask = PF3000_SW3_VOLT_CTRL_MASK;
            break;

        /* Process Switch Boost. */
        case kPF3000_ModuleSwitchBoost:
            regulatorVoltRegAddr = regulatorCtrlRegTab[module];
            regulatorVoltRegMask = PF3000_SW_BST_CTRL_VOLT_MASK;
            break;

        /* Process LDO1, LDO2, LDO3, LDO4. */
        case kPF3000_ModuleLdo1:
        case kPF3000_ModuleLdo2:
        case kPF3000_ModuleLdo3:
        case kPF3000_ModuleLdo4:
            regulatorVoltRegAddr = regulatorCtrlRegTab[module];
            regulatorVoltRegMask = PF3000_LDO_VOLT_CTRL_MASK;
            break;

        /* Process Vcc_sd. */
        case kPF3000_ModuleVcc_sd:
            regulatorVoltRegAddr = regulatorCtrlRegTab[module];
            regulatorVoltRegMask = PF3000_VCC_SD_VOLT_CTRL_MASK;
            break;

        /* Process V33. */
        case kPF3000_ModuleV33:
            regulatorVoltRegAddr = regulatorCtrlRegTab[module];
            regulatorVoltRegMask = PF3000_V33_VOLT_CTRL_MASK;
            break;

        /* Process Vsnvs. */
        case kPF3000_ModuleVsnvs:
            regulatorVoltRegAddr = regulatorCtrlRegTab[module];
            regulatorVoltRegMask = PF3000_VSNVS_VOLT_CTRL_MASK;
            break;

        default:
            regulatorVoltRegAddr = 0x00U;
            regulatorVoltRegMask = 0x00U;
            break;
    }

    /* Get Register Value. */
    PF3000_ReadReg(handle, regulatorVoltRegAddr, &regulatorVoltRegContent);
    /* Modify Register Value. */
    regulatorVoltRegContent = regulatorVoltRegContent & regulatorVoltRegMask;
    /* Get LDO Voltage Control Value. */
    voltage = PF3000_GetRegulatorOutputVolt(handle, module, regulatorVoltRegContent);

    return voltage;
}

void PF3000_EnableRegulator(pf3000_handle_t *handle, pf3000_module_t module, bool enable)
{
    uint8_t regulatorCtrlRegAddr;

    assert(handle);
    assert((kPF3000_ModuleSwitch1A == module) || (kPF3000_ModuleSwitch1B == module) ||
           (kPF3000_ModuleSwitch2 == module) || (kPF3000_ModuleSwitch3 == module) ||
           (kPF3000_ModuleSwitchBoost == module) || (kPF3000_ModuleLdo1 == module) || (kPF3000_ModuleLdo2 == module) ||
           (kPF3000_ModuleLdo3 == module) || (kPF3000_ModuleLdo4 == module) || (kPF3000_ModuleVcc_sd == module) ||
           (kPF3000_ModuleV33 == module) || (kPF3000_ModuleVsnvs == module) || (kPF3000_ModuleVrefDdr == module));

    switch (module)
    {
        case kPF3000_ModuleLdo1:
        case kPF3000_ModuleLdo2:
        case kPF3000_ModuleLdo3:
        case kPF3000_ModuleLdo4:
        case kPF3000_ModuleVcc_sd:
        case kPF3000_ModuleV33:
            /* Get LDO Control Register Address. */
            regulatorCtrlRegAddr = regulatorCtrlRegTab[module];
            /* Modify LDO Control Register Value. */
            PF3000_ModifyReg(handle, regulatorCtrlRegAddr, PF3000_LDO_ENABLE_MASK,
                             (enable ? PF3000_LDO_ENABLE_MASK : 0x0U));
            break;

        case kPF3000_ModuleVrefDdr:
            /* Modify Vrefddr Control Register Value. */
            PF3000_ModifyReg(handle, PF3000_VREFDDR_CTRL, PF3000_VREFDDR_SUPPLY_ENABLE_MASK,
                             (enable ? PF3000_VREFDDR_SUPPLY_ENABLE_MASK : 0x0U));
            break;

        case kPF3000_ModuleSwitch1A:
        case kPF3000_ModuleSwitch1B:
        case kPF3000_ModuleSwitch2:
        case kPF3000_ModuleSwitch3:
        case kPF3000_ModuleSwitchBoost:
        case kPF3000_ModuleVsnvs:
        default:
            break;
    }
}

bool PF3000_IsRegulatorEnabled(pf3000_handle_t *handle, pf3000_module_t module)
{
    bool result;
    uint8_t regulatorCtrlRegAddr;
    uint8_t regulatorCtrlRegContent;

    assert(handle);
    assert((kPF3000_ModuleSwitch1A == module) || (kPF3000_ModuleSwitch1B == module) ||
           (kPF3000_ModuleSwitch2 == module) || (kPF3000_ModuleSwitch3 == module) ||
           (kPF3000_ModuleSwitchBoost == module) || (kPF3000_ModuleLdo1 == module) || (kPF3000_ModuleLdo2 == module) ||
           (kPF3000_ModuleLdo3 == module) || (kPF3000_ModuleLdo4 == module) || (kPF3000_ModuleVcc_sd == module) ||
           (kPF3000_ModuleV33 == module) || (kPF3000_ModuleVsnvs == module) || (kPF3000_ModuleVrefDdr == module));

    switch (module)
    {
        case kPF3000_ModuleLdo1:
        case kPF3000_ModuleLdo2:
        case kPF3000_ModuleLdo3:
        case kPF3000_ModuleLdo4:
        case kPF3000_ModuleVcc_sd:
        case kPF3000_ModuleV33:
            /* Get LDO Control Register Content. */
            regulatorCtrlRegAddr = regulatorCtrlRegTab[module];
            /* Read LDO Control Register Value. */
            PF3000_ReadReg(handle, regulatorCtrlRegAddr, &regulatorCtrlRegContent);
            /* LDO enable judge */
            result = (regulatorCtrlRegContent & PF3000_LDO_ENABLE_MASK) ? true : false;
            break;

        case kPF3000_ModuleVrefDdr:
            /* Get Vrefddr Control Register Content. */
            regulatorCtrlRegAddr = regulatorCtrlRegTab[module];
            /* Read Vrefddr Control Register Value. */
            PF3000_ReadReg(handle, regulatorCtrlRegAddr, &regulatorCtrlRegContent);
            /* Vrefddr enable judge */
            result = (regulatorCtrlRegContent & PF3000_VREFDDR_SUPPLY_ENABLE_MASK) ? true : false;
            break;

        case kPF3000_ModuleSwitch1A:
        case kPF3000_ModuleSwitch1B:
        case kPF3000_ModuleSwitch2:
        case kPF3000_ModuleSwitch3:
        case kPF3000_ModuleSwitchBoost:
        case kPF3000_ModuleVsnvs:
            /* They are enabled by default */
            result = true;
            break;

        default:
            result = false;
            break;
    }

    return result;
}

